_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СопоставлениеСметныхРесурсовОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СопоставлениеСметныхРесурсовОбъектам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектУСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СметныйРесурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВариантыИспользованияХарактеристикНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыИспользованияХарактеристикНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеДляВидаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныеДляНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеСДругимВидомНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаМашинистов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиныИМеханизмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принципал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_Ресурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ГодыВыпускаБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКДП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьСтоимостьНаОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УпаковкиЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УпаковкиЕдиницыИзмерения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НаборыУпаковок</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Безразмерная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глубина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Числитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Знаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинейныеРазмерыПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеГруппыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипоразмерыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляетсяВМногооборотнойТаре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураМногооборотнаяТара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаМногооборотнаяТара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеКоличествоУпаковокМногооборотнойТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзмеряемойВеличины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИзмеряемыхВеличин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеСокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУпаковокНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СопоставлениеСметныхРесурсовОбъектам/Forms/ФормаВнесенияДанных/Ext/Form/Module.bsl
&НаСервере
Процедура КомандаЗаполнитьНесопоставленнымиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_СопоставлениеСметныхРесурсовОбъектам.СметныйРесурс КАК СметныйРесурс
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	РегистрСведений.УСОERP_СопоставлениеСметныхРесурсовОбъектам КАК УСОERP_СопоставлениеСметныхРесурсовОбъектам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СМ_Ресурсы.Ссылка КАК СметныйРесурс,
	|	НЕОПРЕДЕЛЕНО КАК ОбъектУСО,
	//|	1 КАК Коэффициент,
	|	ВЫБОР КОГДА СМ_Ресурсы.ЕдиницаИзмерения.КоэффициентПеревода = 0 ТОГДА 1 ИНАЧЕ СМ_Ресурсы.ЕдиницаИзмерения.КоэффициентПеревода КОНЕЦ КАК Коэффициент,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЛОЖЬ КАК ХарактеристикиИспользуются
	|ИЗ
	|	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	|ГДЕ
	|	НЕ СМ_Ресурсы.Ссылка В
	|				(ВЫБРАТЬ
	|					ВрТаб.СметныйРесурс
	|				ИЗ
	|					ВрТаб)
	|	И НЕ СМ_Ресурсы.ПометкаУдаления
	|	И НЕ СМ_Ресурсы.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	СМ_Ресурсы.ВидРесурса,
	|	СМ_Ресурсы.Наименование";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(ТЗ,"ТаблицаДанных");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьНесопоставленными(Команда)
	
	КомандаЗаполнитьНесопоставленнымиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаписатьНаСервере()
	
	ТЗ = РеквизитФормыВЗначение("ТаблицаДанных");
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабДанных.СметныйРесурс КАК СметныйРесурс,
	|	ТабДанных.ОбъектУСО КАК ОбъектУСО,
	|	ТабДанных.Характеристика КАК Характеристика,
	|	ТабДанных.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	&ТЗ КАК ТабДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаб.СметныйРесурс КАК СметныйРесурс,
	|	ВрТаб.ОбъектУСО КАК ОбъектУСО,
	|	ВрТаб.Характеристика КАК Характеристика,
	|	ВрТаб.Коэффициент КАК Коэффициент
	|ИЗ
	|	ВрТаб КАК ВрТаб
	|ГДЕ
	|	ВрТаб.СметныйРесурс <> ЗНАЧЕНИЕ(Справочник.СМ_Ресурсы.ПустаяСсылка)
	|	И ВрТаб.ОбъектУСО <> НЕОПРЕДЕЛЕНО
	|	И ВрТаб.ОбъектУСО <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И ВрТаб.ОбъектУСО <> ЗНАЧЕНИЕ(Справочник.УСОERP_Ресурсы.ПустаяСсылка)
	|	И ВрТаб.Коэффициент > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МенеджерЗаписи = РегистрыСведений.УСОERP_СопоставлениеСметныхРесурсовОбъектам.СоздатьМенеджерЗаписи();
	
	Пока Выборка.Следующий() Цикл		
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
		МенеджерЗаписи.Прочитать();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	КомандаЗаписатьНаСервере();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УСОERP_СопоставлениеСметныхРесурсовОбъектам.СметныйРесурс КАК СметныйРесурс,
	|	УСОERP_СопоставлениеСметныхРесурсовОбъектам.ОбъектУСО КАК ОбъектУСО,
	|	УСОERP_СопоставлениеСметныхРесурсовОбъектам.Характеристика КАК Характеристика,
	|	УСОERP_СопоставлениеСметныхРесурсовОбъектам.Коэффициент КАК Коэффициент,
	|	УСОERP_СопоставлениеСметныхРесурсовОбъектам.ОбъектУСО КАК Номенклатура,
	|	ЕСТЬNULL(УСОERP_СопоставлениеСметныхРесурсовОбъектам.ОбъектУСО.ИспользованиеХарактеристик, ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать) КАК ХарактеристикиИспользуются
	|ИЗ
	|	РегистрСведений.УСОERP_СопоставлениеСметныхРесурсовОбъектам КАК УСОERP_СопоставлениеСметныхРесурсовОбъектам
	|
	|УПОРЯДОЧИТЬ ПО
	|	УСОERP_СопоставлениеСметныхРесурсовОбъектам.СметныйРесурс.ВидРесурса,
	|	УСОERP_СопоставлениеСметныхРесурсовОбъектам.СметныйРесурс.Наименование";
	
	ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(),"ТаблицаДанных");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	КомандаОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекСтрока = Элементы.ТаблицаДанных.ТекущиеДанные;
		ТекСтрока.Коэффициент = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхСметныйРесурсПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ТаблицаДанных.ТекущиеДанные;
	ЗаполнитьДанныеСтроительногоРесурса(ТекСтрока.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьДанныеСтроительногоРесурса(ИдСтроки)
	
	ТекСтрока = ТаблицаДанных.НайтиПоИдентификатору(ИдСтроки);
	ТекСтрока.ОбъектУСО = Неопределено;
	ТекСтрока.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	ТекСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	ТекСтрока.ХарактеристикиИспользуются = Ложь;
	ТекСтрока.Коэффициент = ?(ТекСтрока.СметныйРесурс.ЕдиницаИзмерения.КоэффициентПеревода = 0,1,ТекСтрока.СметныйРесурс.ЕдиницаИзмерения.КоэффициентПеревода);
	
	НЗ = РегистрыСведений.УСОERP_СопоставлениеСметныхРесурсовОбъектам.СоздатьНаборЗаписей();
	НЗ.Отбор.СметныйРесурс.Установить(ТекСтрока.СметныйРесурс);
	НЗ.Прочитать();
	
	Если НЗ.Количество() Тогда
		ЗаполнитьЗначенияСвойств(ТекСтрока,НЗ.Получить(0),"ОбъектУСО,Характеристика,Коэффициент");
		ТекСтрока.Номенклатура = ТекСтрока.ОбъектУСО;
		ТекСтрока.ХарактеристикиИспользуются = ТекСтрока.Номенклатура.ИспользованиеХарактеристик <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;
	КонецЕсли;
		
КонецПроцедуры


&НаСервереБезКонтекста
Функция ВидРесурса(Ресурс)
	
	Если Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	КонецЕсли;
	
	Если Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов 
		ИЛИ Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих
		ИЛИ Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы 
		ИЛИ Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Оборудование Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.УСОERP_Ресурсы");
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции  

&НаКлиенте
Процедура КомандаЗаполнитьПоСмете(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоСметеВыбор",ЭтотОбъект);
	
	ПоказатьВводЗначения(ОписаниеОповещения,ПредопределенноеЗначение("Документ.СМ_ЛокальнаяСмета.ПустаяСсылка"));
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПоСметеВыбор(ВыбранноеЗначение,ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоСметеНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСметеНаСервере(Смета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Смета",Смета);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы.Ресурс КАК Ресурс
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	Документ.СМ_ПозицияЛокальнойСметы.РесурсыПозицииЛокальнойСметы КАК СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы
	|ГДЕ
	|	СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы.Ссылка.ИДСметы = &Смета
	|
	|СГРУППИРОВАТЬ ПО
	|	СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы.Ресурс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаб.Ресурс КАК СметныйРесурс,
	|	ЕСТЬNULL(УСОERP_СопоставлениеСметныхРесурсовОбъектам.ОбъектУСО, НЕОПРЕДЕЛЕНО) КАК ОбъектУСО,
	|	ЕСТЬNULL(УСОERP_СопоставлениеСметныхРесурсовОбъектам.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ЕСТЬNULL(УСОERP_СопоставлениеСметныхРесурсовОбъектам.ОбъектУСО, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	//|	ЕСТЬNULL(УСОERP_СопоставлениеСметныхРесурсовОбъектам.Коэффициент, 1) КАК Коэффициент,
	|	ЕСТЬNULL(УСОERP_СопоставлениеСметныхРесурсовОбъектам.Коэффициент, ВЫБОР КОГДА ВрТаб.Ресурс.ЕдиницаИзмерения.КоэффициентПеревода = 0 ТОГДА 1 ИНАЧЕ ВрТаб.Ресурс.ЕдиницаИзмерения.КоэффициентПеревода КОНЕЦ) КАК Коэффициент, 
	|	ЕСТЬNULL(УСОERP_СопоставлениеСметныхРесурсовОбъектам.ОбъектУСО.ИспользованиеХарактеристик, ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать) КАК ХарактеристикиИспользуются
	|ИЗ
	|	ВрТаб КАК ВрТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_СопоставлениеСметныхРесурсовОбъектам КАК УСОERP_СопоставлениеСметныхРесурсовОбъектам
	|		ПО ВрТаб.Ресурс = УСОERP_СопоставлениеСметныхРесурсовОбъектам.СметныйРесурс
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВрТаб.Ресурс.ВидРесурса,
	|	ВрТаб.Ресурс.Наименование";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(ТЗ,"ТаблицаДанных");
	
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаДанныхОбъектУСОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ТаблицаДанных.ТекущиеДанные;
	Элемент.ОграничениеТипа = ВидРесурса(ТекСтрока.СметныйРесурс);
	Значение = ТекСтрока.ОбъектУСО;
	ТекСтрока.ОбъектУСО = Элемент.ОграничениеТипа.ПривестиЗначение(Значение);
	
КонецПроцедуры  

&НаКлиенте
Процедура ТаблицаДанныхХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ТаблицаДанных.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ТаблицаДанныхЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ТаблицаДанных.ТекущиеДанные;
	Если ТипЗнч(ТекСтрока.ОбъектУСО) <> Тип("СправочникСсылка.Номенклатура") Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДанныхОбъектУСОПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ТаблицаДанных.ТекущиеДанные;
	ТекСтрока.Номенклатура = ТекСтрока.ОбъектУСО;
	ТекСтрока.ХарактеристикиИспользуются =  ИспользованиеХарактеристик(ТекСтрока.Номенклатура);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользованиеХарактеристик(Номенклатура)
	
	Возврат Номенклатура.ИспользованиеХарактеристик <> ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать");
	
КонецФункции  

&НаКлиенте
Процедура ТаблицаДанныхПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДанныхПослеУдаления(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КомандаОбновитьНаСервере();
	//НоменклатураСервер.ЗаполнитьПризнакИспользованияХарактеристик(ТаблицаДанных);
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма,"ТаблицаДанныхХарактеристика","ТаблицаДанных.ХарактеристикиИспользуются");
	

КонецПроцедуры


&НаСервере
Процедура КомандаЗаполнитьВсеРесурсыНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_Ресурсы.Ссылка КАК СметныйРесурс,
	|	УСОERP_СопоставлениеСметныхРесурсовОбъектам.ОбъектУСО КАК ОбъектУСО,
	|	УСОERP_СопоставлениеСметныхРесурсовОбъектам.Характеристика КАК Характеристика,
	//|	ЕСТЬNULL(УСОERP_СопоставлениеСметныхРесурсовОбъектам.Коэффициент, 1) КАК Коэффициент,
	|	ЕСТЬNULL(УСОERP_СопоставлениеСметныхРесурсовОбъектам.Коэффициент, ВЫБОР КОГДА СМ_Ресурсы.ЕдиницаИзмерения.КоэффициентПеревода = 0 ТОГДА 1 ИНАЧЕ СМ_Ресурсы.ЕдиницаИзмерения.КоэффициентПеревода КОНЕЦ) КАК Коэффициент,
	|	УСОERP_СопоставлениеСметныхРесурсовОбъектам.ОбъектУСО КАК Номенклатура,
	|	ЕСТЬNULL(УСОERP_СопоставлениеСметныхРесурсовОбъектам.ОбъектУСО.ИспользованиеХарактеристик, ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)) <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать) КАК ХарактеристикиИспользуются
	|ИЗ
	|	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_СопоставлениеСметныхРесурсовОбъектам КАК УСОERP_СопоставлениеСметныхРесурсовОбъектам
	|		ПО СМ_Ресурсы.Ссылка = УСОERP_СопоставлениеСметныхРесурсовОбъектам.СметныйРесурс
	|ГДЕ
	|	НЕ СМ_Ресурсы.ПометкаУдаления
	|	И НЕ СМ_Ресурсы.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	СМ_Ресурсы.ВидРесурса,
	|	СМ_Ресурсы.Наименование";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(ТЗ,"ТаблицаДанных");
	
КонецПроцедуры 

&НаКлиенте
Процедура КомандаЗаполнитьВсеРесурсы(Команда)
	КомандаЗаполнитьВсеРесурсыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхСметныйРесурсОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
КонецПроцедуры

#Область СозданиеНоменклатуры

&НаКлиенте
Процедура КомандаСоздатьНоменклатуру(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаСоздатьНоменклатурыПродолжение",ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.УСОERP_СопоставлениеСметныхРесурсовОбъектам.Форма.ФормаСозданияНоменклатуры",,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура  КомандаСоздатьНоменклатурыПродолжение(Результат,ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтр ИЗ Элементы.ТаблицаДанных.ВыделенныеСтроки Цикл
		
		СоздатьНоменклатуру(ТекСтр,Результат);		
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНоменклатуру(ТекСтр,Результат)
	
	Строка = ТаблицаДанных.НайтиПоИдентификатору(ТекСтр);
	
	Если ТаблицаДанных.НайтиПоИдентификатору(ТекСтр).СметныйРесурс.ВидРесурса <>  Перечисления.СМ_ВидыРесурсов.Материалы Тогда
		Возврат;
	КонецЕсли;
	
	ВидНоменклатуры = Результат.ВидНоменклатуры;
	
	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	
	Если НайтиНоменклатуру(Строка.СметныйРесурс.Наименование,ВидНоменклатуры,Номенклатура) Тогда 
		
		Если Строка.ОбъектУСО = Номенклатура Тогда
			Возврат;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для сметного материала """+ Строка.СметныйРесурс.Наименование+""" есть номенклатура с данным наименованием. Новая номенклатура не создана"); 
		
		Строка.ОбъектУСО = Номенклатура;
		Строка.Характеристика = "";
		Строка.ХарактеристикиИспользуются = (Номенклатура.ИспользованиеХарактеристик <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать);
		Строка.Коэффициент = 1;
		
		Возврат;
		
	КонецЕсли;
	
	НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
	НовыйЭлемент.ВидНоменклатуры = ВидНоменклатуры;
	НовыйЭлемент.Заполнить(ВидНоменклатуры);
	НовыйЭлемент.Наименование =  Строка.СметныйРесурс.Наименование;
	НовыйЭлемент.НаименованиеПолное = Строка.СметныйРесурс.Наименование;
	
	Если НЕ ЗначениеЗаполнено(НовыйЭлемент.ИспользованиеХарактеристик) Тогда
		НовыйЭлемент.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ ИЗ Результат.ОбязательныеРеквизиты Цикл
		
		НовыйЭлемент[СтрокаТЧ.ИмяРеквизита] = СтрокаТЧ.Значение;
		
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(Строка.СметныйРесурс.ЕдиницаИзмерения.КодОКЕИ) Тогда
		
		Единица = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду(Формат(Строка.СметныйРесурс.ЕдиницаИзмерения.КодОКЕИ,"ЧЦ=3; ЧВН="));
		
		Если ЗначениеЗаполнено(Единица) тогда
			НовыйЭлемент.ЕдиницаИзмерения = Единица;
			Строка.Коэффициент = Строка.СметныйРесурс.ЕдиницаИзмерения.КоэффициентПеревода;
		КонецЕсли; 		
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НовыйЭлемент.ЕдиницаИзмерения) Тогда
		НовыйЭлемент.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("796");
		Строка.Коэффициент = 1; 
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(НовыйЭлемент.ЕдиницаДляОтчетов) Тогда
		НовыйЭлемент.ЕдиницаДляОтчетов = НовыйЭлемент.ЕдиницаИзмерения;
	КонецЕсли;
	
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	НовыйЭлемент.УстановитьНовыйКод();
	НовыйЭлемент.Родитель = Результат.Родитель;
	НовыйЭлемент.Записать();
	
	Строка.ОбъектУСО = НовыйЭлемент.Ссылка;
	Строка.Номенклатура = Строка.ОбъектУСО;
	Строка.Характеристика = "";
	Строка.ХарактеристикиИспользуются = (Строка.Номенклатура.ИспользованиеХарактеристик <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиНоменклатуру(Наименование,ВидНоменклатуры,Номенклатура)    
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Наименование",Строка(Наименование));
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И (ВЫРАЗИТЬ(Номенклатура.Наименование КАК СТРОКА(100))) = (ВЫРАЗИТЬ(&Наименование КАК СТРОКА(100)))
	|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Номенклатура = Выборка.Ссылка;	   
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
